def W(BMI,BMX):
    W = BMI/(BMX/100)**2
    return W
def Y(X):
    if X <= 18.50:
        print("นํ้าหนักน้อย/ผอม ภาวะเสี่ยงต่อโลก: มากกว่าคนทั่วไป")
    elif X <= 22.9:
        print("ปกติ/สุขภาพดี ภาวะเสี่ยงต่อโลก: เท่าคนปกติ")
    elif X <= 24.9:
        print("ท้วม/โรคอ้วนระดับ 1 ภาวะเสี่ยงต่อโลก: อันตรายระดับ 2")
    elif X <= 29.9:
        print("อ้วน/โรคอ้วนระดับ 2 ภาวะเสี่ยงต่อโลก: อันตรายระดับ 2")
    elif X >= 30:
        print("อ้วนมาก/โรคอ้วนระดับ 3 ภาวะเสี่ยงต่อโลก: อันตรายระดับ 3")
X= float(input("We"))
Z= float(input("Hei"))
print("W = %.2f" % W(X,Z))
Y(W(X,Z))